#ifndef OS_STDARG_H
#define OS_STDARG_H

// +---------------------------+   <-- 高地址
// | ...                       |
// +---------------------------+
// | 参数 2                    |
// +---------------------------+
// | 参数 1                    |
// +---------------------------+
// | 返回地址                  |
// +===========================+   <-- ebp
// | 调用者的栈帧基址           |
// +---------------------------+
// | 局部变量 N                 |
// +---------------------------+
// | 局部变量 N - 1             |
// +---------------------------+
// | ...                       |
// +---------------------------+   <-- 低地址

typedef char *va_list;

#define va_start(ap, v) (ap = (va_list)&v + sizeof(char *))
#define va_arg(ap, t) (*(t *)((ap += sizeof(char *)) - sizeof(char *)))
#define va_end(ap) (ap = (va_list)0)

#endif
